README.md
```mermaid
erDiagram
  role {
      enum_type parent
      enum_type child
  }

  families {
      int4 id PK
      varchar name
      timestamp createdAt
  }

  items {
      int4 id PK
      varchar name
      text description
      int4 createdBy FK
      varchar image
      int4 familyId FK
      timestamp createdAt
      timestamp updatedAt
  }

  items_tags {
      int4 id PK
      int4 itemId FK
      int4 tagId FK
  }

  preferences {
      int4 id PK
      text note
      int4 rating
      date lastChecked
      int4 itemId FK
      int4 userId FK
      int4 familyId FK
      int4 createdBy FK
      timestamp createdAt
      timestamp updatedAt
      index userId_itemId
  }

  tags {
      int4 id PK
      varchar name
      int4 familyId FK
      int4 createdBy FK
      timestamp createdAt
      timestamp updatedAt
      index name_familyId
  }

  users {
      int4 id PK
      varchar avatar
      varchar name
      varchar email
      varchar password
      role role
      int4 familyId FK
      timestamp createdAt
      timestamp updatedAt
  }

  users ||--o{ items : "created"
  families ||--o{ items : "has"
  items ||--o{ items_tags : "has"
  tags ||--o{ items_tags : "in"
  users ||--o{ preferences : "created"
  families ||--o{ preferences : "has"
  items ||--o{ preferences : "has"
  users ||--o{ preferences : "owns"
  users ||--o{ tags : "created"
  families ||--o{ tags : "has"
  families ||--o{ users : "has"
```
